2023/writing/heart0.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-07-20 Thu 16:09 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>heart attack</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../../themes/zenburn.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">heart attack</h1>
<p>
<b>Analysis</b>
</p>

<p>
「色不异空，空不异色，色即是空，空即是色」
</p>

<p>
<b>form is emptiness and emptiness is form</b>
</p>

<p>
The heart sutra is possibly the most preliminary buddhist scripture in terms of exposure. Yet buddhists have spent countless lifetimes meditating on the ideas of <b>form</b> and <b>empty</b>. Why spend time delving separately into two concepts that, from the very beginning, are explicitly stated to be one and the same?
</p>

<p>
A slightly easier mystery to tackle is the existence of four unique statements (and their ordering). The verbs 不异 and 即是 are of great importance here. 即是 is most easily interpreted into formal logic as "implies" (rather than an equivalence relation). 不异 is a little more difficult to construct, as it requires a double negation. The best I can do is "there is nothing that is form which is not emptiness". 
</p>

<ol class="org-ol">
<li>not E implies not F (\(\neg\) E \(\rightarrow\) \(\neg\) F)</li>
<li>not F implies not E (\(\neg\) F \(\rightarrow\) \(\neg\) E)</li>
<li>F implies E (F \(\rightarrow\) E)</li>
<li>E implies F (E \(\rightarrow\) F)</li>
</ol>

<p>
In propositional logic, statements 1 and 2 are the negations of statements 3 and 4. The order of these statements are interesting, in the sense that the "purer" (less operations) statements proceed the intuitively more ugly double negation. However this is representative of the logical processes of buddhism. Deduce truths not by direct observation but rather by first discerning the negative space.
</p>

<p>
For example, it is much more difficult to say "if A is a bat, then it is an animal" than "if A is not an animal, then it is not a bat"
</p>

<blockquote>
<p>
universality? e.g. 3 and 4 use the universal modifier and 1 and 2 use existential modifier &#x2013; begin by making existential observations of the world and follow with claims of universality
</p>
</blockquote>

<p>
The beauty of these four lines is that it captures perfectly the buddhist skepticism towards language as a tool for communicating truths. In fact, most accounts of enlightenment occur completely devoid of language and entirely of action or observation, such as the first glimpse of a cherry blossom or the moment a bucket is tipped over.
</p>

<blockquote>
<p>
the expression of logical equivalence is garbled by language, as by stating the parts we are forced to conceive of them as separate entities. 
</p>
</blockquote>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2023-07-20 Thu 16:09</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
